Revit 2024 API
BuiltInFailures.DetailFailures.RepeatingDetailSpacingZeroError Property
 Spacing must be greater than 0
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RepeatingDetailSpacingZeroError { get; }
Visual Basic
Public Shared ReadOnly Property RepeatingDetailSpacingZeroError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RepeatingDetailSpacingZeroError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DetailFailures Class
Autodesk.Revit.DB Namespace